Repository: zizicici/Doufu
Catalog: Doufu/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

# scan.llm.running
source: Analyzing...
zh_hans: 分析中…
zh_hk: 分析中…

# scan.llm.title
source: LLM Review
zh_hans: LLM 审查
zh_hk: LLM 審查

# scan.no_findings
source: No issues detected by static analysis
zh_hans: 静态分析未检测到问题
zh_hk: 靜態分析未檢測到問題

# scan.risk.critical
source: Critical Risk
zh_hans: 严重风险
zh_hk: 嚴重風險

# scan.risk.high
source: High Risk
zh_hans: 高风险
zh_hk: 高風險

# scan.risk.low
source: Low Risk
zh_hans: 低风险
zh_hk: 低風險

# scan.risk.medium
source: Medium Risk
zh_hans: 中风险
zh_hk: 中風險

# scan.section.archive_info
source: Archive Information
zh_hans: 归档信息
zh_hk: 封存資訊

# scan.section.llm
source: LLM Review
zh_hans: LLM 审查
zh_hk: LLM 審查

# scan.section.project_info
source: Project Information
zh_hans: 项目信息
zh_hk: 專案資訊

# scan.section.static
source: Static Analysis
zh_hans: 静态分析
zh_hk: 靜態分析

# scan.static.scanning
source: Scanning files...
zh_hans: 正在扫描文件…
zh_hk: 正在掃描檔案…

# scan.title
source: Import Review
zh_hans: 导入审查
zh_hk: 導入審查

# scan.title.review
source: Code Review
zh_hans: 代码审查
zh_hk: 程式碼審查

# settings.about.eula
source: EULA
zh_hans: 最终用户许可协议
zh_hk: 最終用戶許可協議

# settings.about.privacy_policy
source: Privacy Policy
zh_hans: 隐私政策
zh_hk: 隱私政策

# settings.about.review
source: Rate on App Store
zh_hans: App Store 评分
zh_hk: App Store 評分

# settings.about.share
source: Share App
zh_hans: 分享应用
zh_hk: 分享應用

# settings.about.specifications
source: Specifications
zh_hans: 规格参数
zh_hk: 規格參數

# settings.appjun.more
source: More Apps
zh_hans: 更多应用
zh_hk: 更多應用

# settings.chat.pip_progress.footer
source: When enabled, a Picture-in-Picture window shows real-time task progress while the app is in the background.
zh_hans: 开启后，App 在后台时会通过画中画窗口实时显示任务进度。
zh_hk: 開啟後，App 在背景時會透過畫中畫視窗即時顯示任務進度。

# settings.chat.pip_progress.off
source: Off
zh_hans: 关闭
zh_hk: 關閉

# settings.chat.pip_progress.on
source: On
zh_hans: 开启
zh_hk: 開啟

# settings.chat.tool_permission.footer
source: Default tool permission for new projects. Individual projects can override this in project settings.
zh_hans: 新项目的默认工具权限。各项目可在项目设置中单独覆盖。
zh_hk: 新項目的預設工具權限。各項目可在項目設定中單獨覆蓋。

# settings.chat.tool_permission.title
source: Tool Permission
zh_hans: 工具权限
zh_hk: 工具權限

# settings.common.off
source: Off
zh_hans: 关闭
zh_hk: 關閉

# settings.common.on
source: On
zh_hans: 开启
zh_hk: 開啟

# settings.contact.bilibili
source: Bilibili
zh_hans: 哔哩哔哩
zh_hk: 嗶哩嗶哩

# settings.contact.email
source: Email
zh_hans: 邮箱
zh_hk: 郵箱

# settings.contact.xiaohongshu
source: Xiaohongshu
zh_hans: 小红书
zh_hk: 小紅書

# settings.default_model.footer
source: The default model is used when opening a new project. Each project and thread can override this selection.
zh_hans: 默认模型用于新项目的初始选择。每个项目和会话可以单独设置不同的模型。
zh_hk: 預設模型用於新項目的初始選擇。每個項目和會話可以單獨設定不同的模型。

# settings.default_model.invalid
source: Invalid App Default
zh_hans: App 默认模型无效
zh_hk: App 預設模型無效

# settings.default_model.not_set
source: Not Set
zh_hans: 未设置
zh_hk: 未設定

# settings.default_model.provider_hint
source: Select a provider first, then choose a model.
zh_hans: 请先选择一个服务商，然后选择模型。
zh_hk: 請先選擇一個服務商，然後選擇模型。

# settings.default_model.title
source: Default Model
zh_hans: 默认模型
zh_hk: 預設模型

# settings.general.language.subtitle
source: App display language
zh_hans: App 显示的语言
zh_hk: App 顯示的語言

# settings.general.language.title
source: Language
zh_hans: 语言
zh_hk: 語言

# settings.manage_providers.configured_count_format
source: %lld configured
zh_hans: 已配置 %lld 个
zh_hk: 已配置 %lld 個

# settings.manage_providers.title
source: Manage Providers
zh_hans: 管理提供商
zh_hk: 管理提供商

# settings.permissions.camera
source: Camera
zh_hans: 相机
zh_hk: 相機

# settings.permissions.clipboard_read
source: Clipboard Read
zh_hans: 剪贴板读取
zh_hk: 剪貼簿讀取

# settings.permissions.clipboard_write
source: Clipboard Write
zh_hans: 剪贴板写入
zh_hk: 剪貼簿寫入

# settings.permissions.location
source: Location
zh_hans: 位置
zh_hk: 位置

# settings.permissions.microphone
source: Microphone
zh_hans: 麦克风
zh_hk: 麥克風

# settings.permissions.photo_save
source: Save Photos
zh_hans: 保存照片
zh_hk: 儲存相片

# settings.permissions.project_count_format
source: %d Projects
zh_hans: %d 个项目
zh_hk: %d 個專案

# settings.permissions.status.allowed
source: Allowed
zh_hans: 已允许
zh_hk: 已允許

# settings.permissions.status.denied
source: Denied
zh_hans: 已拒绝
zh_hk: 已拒絕

# settings.permissions.status.not_requested
source: Not Requested
zh_hans: 未请求
zh_hk: 未請求

# settings.permissions.status.restricted
source: Restricted
zh_hans: 受限制
zh_hk: 受限制

# settings.project.auto_collapse_panel.footer
source: When enabled, the floating panel starts collapsed when entering a project.
zh_hans: 开启后，进入项目时浮动面板默认处于收起状态。
zh_hk: 開啟後，進入項目時浮動面板預設處於收起狀態。

# settings.project.auto_collapse_panel.title
source: Start Panel Collapsed
zh_hans: 初始收起面板
zh_hk: 初始收起面板

# settings.providers.title
source: Providers
zh_hans: 提供商
zh_hk: 提供商

# settings.section.about
source: About
zh_hans: 关于
zh_hk: 關於

# settings.section.appjun
source: App Jun
zh_hans: App君
zh_hk: App君

# settings.section.chat
source: Chat
zh_hans: 聊天
zh_hk: 聊天

# settings.section.chat.footer
source: Default tool permission for new projects. Individual projects can override this in project settings.
zh_hans: 新项目的默认工具权限。各项目可在项目设置中单独覆盖。
zh_hk: 新項目的預設工具權限。各項目可在項目設定中單獨覆蓋。

# settings.section.chat.footer.combined
source: Tool permission sets the default for new projects. Progress in Picture uses Picture-in-Picture to show task status.
zh_hans: 工具权限为新项目的默认设置。Progress in Picture 使用画中画显示任务状态。
zh_hk: 工具權限為新項目的預設設定。Progress in Picture 使用畫中畫顯示任務狀態。

# settings.section.contact
source: Contact
zh_hans: 联系我们
zh_hk: 聯絡我們

# settings.section.general
source: General
zh_hans: 通用
zh_hk: 一般

# settings.section.llm_providers
source: LLM Providers & Models
zh_hans: LLM 提供商与模型
zh_hk: LLM 提供商與模型

# settings.section.llm_providers.footer
source: Provider configuration is stored only on this device.
zh_hans: 提供商配置仅保存在本地设备。
zh_hk: 提供商配置僅保存在本地設備。

# settings.section.permissions
source: Permissions
zh_hans: 权限
zh_hk: 權限

# settings.section.permissions.footer
source: These permissions are requested by web apps in your projects. You can change them in system Settings.
zh_hans: 这些权限由你项目中的网页应用请求使用。你可以在系统设置中更改。
zh_hk: 呢啲權限由你專案入面嘅網頁應用程式請求使用。你可以喺系統設定入面更改。

# settings.section.project
source: Project
zh_hans: 项目
zh_hk: 項目

# settings.specifications.license
source: ICP Filing Number
zh_hans: ICP备案号
zh_hk: ICP備案號

# settings.specifications.manufacturer
source: Manufacturer
zh_hans: 制造商
zh_hk: 製造商

# settings.specifications.name
source: Name
zh_hans: 名称
zh_hk: 名稱

# settings.specifications.publisher
source: Publisher
zh_hans: 发行商
zh_hk: 發行商

# settings.specifications.third_party.footer
source: We extend our heartfelt appreciation to all developers of open-source projects.
zh_hans: 衷心感谢所有开源项目的开发者。
zh_hk: 衷心感謝所有開源項目的開發者。

# settings.specifications.third_party.header
source: Third Party Frameworks
zh_hans: 第三方框架
zh_hk: 第三方框架

# settings.specifications.title
source: Specifications
zh_hans: 规格参数
zh_hk: 規格參數

# settings.specifications.version
source: Version
zh_hans: 版本
zh_hk: 版本

# settings.title
source: Settings
zh_hans: 设置
zh_hk: 設置

# shortcuts.entity.project.type_display_name
source: Project
zh_hans: 项目
zh_hk: 專案

# shortcuts.open_project.description
source: Opens a project in Doufu
zh_hans: 在 Doufu 中打开项目
zh_hk: 在 Doufu 中打開專案

# shortcuts.open_project.parameter.project
source: Project
zh_hans: 项目
zh_hk: 專案

# shortcuts.open_project.title
source: Open Project
zh_hans: 打开项目
zh_hk: 打開專案

# snapshot_list.action.load
source: Load
zh_hans: 载入
zh_hk: 載入

# snapshot_list.alert.load.message_format
source: Restore to %@? Current project files will be overwritten.
zh_hans: 确认恢复到 %@ 吗？当前项目文件会被覆盖。
zh_hk: 確認恢復到 %@ 嗎？當前項目文件會被覆蓋。

# snapshot_list.alert.load.title
source: Load Snapshot
zh_hans: 载入快照
zh_hk: 載入快照

# snapshot_list.alert.loaded.message
source: Project has been restored to the selected snapshot.
zh_hans: 项目已恢复到所选快照。
zh_hk: 項目已恢復到所選快照。

# snapshot_list.alert.loaded.title
source: Snapshot Loaded
zh_hans: 已载入快照
zh_hk: 已載入快照

# snapshot_list.alert.read_failed.title
source: Read Failed
zh_hans: 读取失败
zh_hk: 讀取失敗

# snapshot_list.alert.restore_failed.title
source: Load Failed
zh_hans: 载入失败
zh_hk: 載入失敗

# snapshot_list.empty
source: No snapshots
zh_hans: 暂无快照
zh_hk: 暫無快照

# snapshot_list.footer.auto_limit
source: Auto snapshots are created after successful chat changes, up to 10 kept.
zh_hans: 自动快照在聊天成功修改项目后生成，最多保留 10 条。
zh_hk: 自動快照在聊天成功修改項目後生成，最多保留 10 條。

# snapshot_list.footer.manual_limit
source: Up to 10 manual snapshots are retained.
zh_hans: 手动快照最多保留 10 条。
zh_hk: 手動快照最多保留 10 條。

# snapshot_list.title
source: Load Snapshot
zh_hans: 载入快照
zh_hk: 載入快照

# snapshot.alert.saved.message
source: You can restore to this version from "Load Snapshot".
zh_hans: 你可以在“载入快照”中恢复到这个版本。
zh_hk: 你可以在“載入快照”中恢復到這個版本。

# snapshot.alert.saved.title
source: Snapshot Saved
zh_hans: 已保存快照
zh_hk: 已保存快照

# thread_management.current_thread
source: Current
zh_hans: 当前
zh_hk: 目前

# thread_management.delete.message_format
source: Are you sure you want to delete "%@"? This action cannot be undone.
zh_hans: 确定要删除「%@」吗？此操作无法撤销。
zh_hk: 確定要刪除「%@」嗎？此操作無法復原。

# thread_management.delete.title
source: Delete Thread
zh_hans: 删除线程
zh_hk: 刪除線程

# thread_management.footer.hint
source: Tap to rename, swipe left to delete. Use Edit to reorder.
zh_hans: 点击重命名，左滑删除。点击右上角「编辑」可拖拽排序。
zh_hk: 點擊重新命名，左滑刪除。點擊右上角「編輯」可拖曳排序。

# thread_management.rename.title
source: Rename Thread
zh_hans: 重命名线程
zh_hk: 重新命名線程

# thread_management.title
source: Manage Threads
zh_hans: 管理线程
zh_hk: 管理線程

# thread_store.error.invalid_thread_data
source: Thread data is corrupted and cannot be read.
zh_hans: 线程数据损坏，无法读取。
zh_hk: 線程數據損壞，無法讀取。

# thread_store.error.thread_not_found
source: Thread does not exist.
zh_hans: 线程不存在。
zh_hk: 線程不存在。

# thread.default_title
source: Thread 1
zh_hans: 线程 1
zh_hk: 線程 1

# thread.default_title_format
source: Thread %d
zh_hans: 线程 %d
zh_hk: 線程 %d

# tool_activity.detail.created
source: Created
zh_hans: 新建
zh_hk: 新建

# tool_activity.detail.edits_applied_format
source: %lld edit(s) applied
zh_hans: 应用了 %lld 处编辑
zh_hk: 套用了 %lld 處編輯

# tool_activity.detail.errors_format
source: %lld error(s)
zh_hans: %lld 个错误
zh_hk: %lld 個錯誤

# tool_activity.detail.failed
source: Failed
zh_hans: 失败
zh_hk: 失敗

# tool_activity.detail.matches_format
source: %lld match(es)
zh_hans: %lld 个匹配
zh_hk: %lld 個匹配

# tool_activity.detail.matches_in_files_format
source: %lld match(es) in %lld file(s)
zh_hans: 在 %2$lld 个文件中找到 %1$lld 个匹配
zh_hk: 在 %2$lld 個檔案中找到 %1$lld 個匹配

# tool_activity.detail.overwrote
source: Overwrote
zh_hans: 覆盖
zh_hk: 覆蓋

# tool_activity.detail.passed
source: Passed
zh_hans: 通过
zh_hk: 通過

# tool_activity.detail.read_file_format
source: %lld lines, %@
zh_hans: %lld 行，%@
zh_hk: %lld 行，%@

# tool_activity.status.error
source: Error
zh_hans: 错误
zh_hk: 錯誤

# tool_activity.status.ok
source: OK
zh_hans: 成功
zh_hk: 成功

# tool_activity.title
source: Tool Activity
zh_hans: 工具活动
zh_hk: 工具活動

# tool_activity.tool.changed_files
source: Changed Files
zh_hans: 已更改文件
zh_hk: 已更改檔案

# tool_activity.tool.delete_file
source: Delete File
zh_hans: 删除文件
zh_hk: 刪除檔案

# tool_activity.tool.diff_file
source: Diff File
zh_hans: 查看差异
zh_hk: 查看差異

# tool_activity.tool.edit_file
source: Edit File
zh_hans: 编辑文件
zh_hk: 編輯檔案

# tool_activity.tool.glob_files
source: Glob Files
zh_hans: 匹配文件
zh_hk: 匹配檔案

# tool_activity.tool.grep_files
source: Grep Files
zh_hans: 正则搜索
zh_hk: 正則搜尋

# tool_activity.tool.list_directory
source: List Directory
zh_hans: 列出目录
zh_hk: 列出目錄

# tool_activity.tool.move_file
source: Move File
zh_hans: 移动文件
zh_hk: 移動檔案

# tool_activity.tool.read_file
source: Read File
zh_hans: 读取文件
zh_hk: 讀取檔案

# tool_activity.tool.revert_file
source: Revert File
zh_hans: 还原文件
zh_hk: 還原檔案

# tool_activity.tool.search_files
source: Search Files
zh_hans: 搜索文件
zh_hk: 搜尋檔案

# tool_activity.tool.validate_code
source: Validate Code
zh_hans: 验证代码
zh_hk: 驗證程式碼

# tool_activity.tool.web_fetch
source: Web Fetch
zh_hans: 获取网页
zh_hk: 擷取網頁

# tool_activity.tool.web_search
source: Web Search
zh_hans: 网页搜索
zh_hk: 網頁搜尋

# tool_activity.tool.write_file
source: Write File
zh_hans: 写入文件
zh_hk: 寫入檔案

# tool_permission.mode.auto_non_destructive
source: Auto-approve Safe Operations
zh_hans: 自动批准安全操作
zh_hk: 自動批准安全操作

# tool_permission.mode.auto_non_destructive.subtitle
source: Auto-approve file read/write/edit. Only prompt for delete and web access.
zh_hans: 自动批准文件读写和编辑。仅在删除和网络访问时提示。
zh_hk: 自動批准檔案讀寫和編輯。僅在刪除和網路存取時提示。

# tool_permission.mode.full_auto
source: Full Auto-approve
zh_hans: 完全自动批准
zh_hk: 完全自動批准

# tool_permission.mode.full_auto.subtitle
source: Never prompt. The AI can perform all operations without confirmation.
zh_hans: 从不提示。AI 可以执行所有操作而无需确认。
zh_hk: 從不提示。AI 可以執行所有操作而無需確認。

# tool_permission.mode.standard
source: Ask Every Time
zh_hans: 每次询问
zh_hk: 每次詢問

# tool_permission.mode.standard.subtitle
source: Prompt on first write/edit, always prompt for delete and web access.
zh_hans: 首次写入/编辑时提示，删除和网络访问始终提示。
zh_hk: 首次寫入/編輯時提示，刪除和網路存取始終提示。

# tool_permission.picker.message
source: Choose how much autonomy the AI has when performing file and web operations.
zh_hans: 选择 AI 执行文件和网络操作时的自主程度。
zh_hk: 選擇 AI 執行檔案和網路操作時的自主程度。

# tool_permission.picker.title
source: Tool Permissions
zh_hans: 工具权限
zh_hk: 工具權限

# tool.activity.changed_files
source: List changed files
zh_hans: 查看已更改文件
zh_hk: 查看已更改檔案

# tool.activity.delete_file
source: Delete: %@
zh_hans: 删除文件：%@
zh_hk: 刪除檔案：%@

# tool.activity.diff_file
source: Diff: %@
zh_hans: 查看差异：%@
zh_hk: 查看差異：%@

# tool.activity.edit_file
source: Edit: %@ (%lld edits)
zh_hans: 编辑文件：%@（%lld 处修改）
zh_hk: 編輯檔案：%@（%lld 處修改）

# tool.activity.glob_files
source: Glob: %@
zh_hans: 查找文件：%@
zh_hk: 查找檔案：%@

# tool.activity.grep_files
source: Grep: /%@/
zh_hans: 正则搜索：/%@/
zh_hk: 正則搜尋：/%@/

# tool.activity.list_directory
source: Browse: %@
zh_hans: 浏览目录：%@
zh_hk: 瀏覽目錄：%@

# tool.activity.move_file
source: Move: %@ → %@
zh_hans: 移动文件：%@ → %@
zh_hk: 移動檔案：%@ → %@

# tool.activity.read_file
source: Read: %@
zh_hans: 读取文件：%@
zh_hk: 讀取檔案：%@

# tool.activity.revert_file
source: Revert: %@
zh_hans: 还原文件：%@
zh_hk: 還原檔案：%@

# tool.activity.search_files
source: Search: "%@"
zh_hans: 搜索文件："%@"
zh_hk: 搜尋檔案："%@"

# tool.activity.unknown
source: Tool: %@
zh_hans: 执行工具：%@
zh_hk: 執行工具：%@

# tool.activity.web_fetch
source: Fetch: %@
zh_hans: 获取网页：%@
zh_hk: 取得網頁：%@

# tool.activity.web_search
source: Web search: "%@"
zh_hans: 搜索网页："%@"
zh_hk: 搜尋網頁："%@"

# tool.activity.write_file
source: Write: %@
zh_hans: 写入文件：%@
zh_hk: 寫入檔案：%@

# tool.confirm.allow
source: Allow
zh_hans: 允许
zh_hk: 允許

# tool.confirm.create_file
source: Create file: %@
zh_hans: 创建文件：%@
zh_hk: 建立檔案：%@

# tool.confirm.delete_file
source: Delete file: %@
zh_hans: 删除文件：%@
zh_hk: 刪除檔案：%@

# tool.confirm.deny
source: Deny
zh_hans: 拒绝
zh_hk: 拒絕

# tool.confirm.edit_file
source: Edit file: %@ (%d edits)
zh_hans: 编辑文件：%@（%d 处修改）
zh_hk: 編輯檔案：%@（%d 處修改）

# tool.confirm.move_file
source: Move %@ to %@
zh_hans: 移动 %@ 到 %@
zh_hk: 移動 %@ 到 %@

# tool.confirm.overwrite_file
source: Overwrite file: %@
zh_hans: 覆盖文件：%@
zh_hk: 覆寫檔案：%@

# tool.confirm.revert_file
source: Revert file: %@
zh_hans: 还原文件：%@
zh_hk: 還原檔案：%@

# tool.confirm.title
source: Tool Permission
zh_hans: 工具权限
zh_hk: 工具權限

# tool.confirm.title.destructive
source: Destructive Operation
zh_hans: 危险操作
zh_hk: 危險操作

# tool.confirm.web_fetch
source: Fetch URL: %@
zh_hans: 获取网页：%@
zh_hk: 擷取網頁：%@

# tool.confirm.web_search
source: Web search: %@
zh_hans: 搜索网页：%@
zh_hk: 搜尋網頁：%@

# tool.progress.creating_file
source: Creating: %@
zh_hans: 创建文件：%@
zh_hk: 建立檔案：%@

# tool.progress.deleting_file
source: Deleting: %@
zh_hans: 删除文件：%@
zh_hk: 刪除檔案：%@

# tool.progress.editing_file
source: Editing: %@ (%d edits)
zh_hans: 编辑文件：%@（%d 处修改）
zh_hk: 編輯檔案：%@（%d 處修改）

# tool.progress.file_edited
source: Edited: %@ (%d/%d applied)
zh_hans: 已编辑：%@（%d/%d 成功）
zh_hk: 已編輯：%@（%d/%d 成功）

# tool.progress.file_read
source: Read: %@ (%d lines)
zh_hans: 已读取：%@（%d 行）
zh_hk: 已讀取：%@（%d 行）

# tool.progress.file_written
source: Written: %@ (%d chars)
zh_hans: 已写入：%@（%d 字符）
zh_hk: 已寫入：%@（%d 字元）

# tool.progress.glob_files
source: Finding files: %@
zh_hans: 查找文件：%@
zh_hk: 查找檔案：%@

# tool.progress.grep_files
source: Regex search: /%@/
zh_hans: 正则搜索：/%@/
zh_hk: 正則搜尋：/%@/

# tool.progress.listing_directory
source: Listing: %@
zh_hans: 浏览目录：%@
zh_hk: 瀏覽目錄：%@

# tool.progress.parallel_batch
source: Running %d read operations in parallel…
zh_hans: 并行执行 %d 个读取操作...
zh_hk: 並行執行 %d 個讀取操作...

# tool.progress.reading_file
source: Reading: %@
zh_hans: 读取文件：%@
zh_hk: 讀取檔案：%@

# tool.progress.search_completed
source: %@ (%d results)
zh_hans: %@（%d 个结果）
zh_hk: %@（%d 個結果）

# tool.progress.search_files
source: Searching: "%@"
zh_hans: 搜索文件："%@"
zh_hk: 搜尋檔案："%@"

# tool.progress.thinking
source: Thinking deeply…
zh_hans: 正在深度思考...
zh_hk: 正在深度思考...

# tool.progress.validating_code
source: Validating: %@
zh_hans: 验证代码：%@
zh_hk: 驗證程式碼：%@

# tool.progress.validation_failed
source: Found %d error(s): %@
zh_hans: 发现 %d 个错误：%@
zh_hk: 發現 %d 個錯誤：%@

# tool.progress.validation_passed
source: Validation passed: %@
zh_hans: 验证通过：%@
zh_hk: 驗證通過：%@

# tool.progress.web_fetch
source: Fetching: %@
zh_hans: 获取网页：%@
zh_hk: 取得網頁：%@

# tool.progress.web_search
source: Searching web: "%@"
zh_hans: 搜索网页："%@"
zh_hk: 搜尋網頁："%@"

# tool.progress.writing_file
source: Writing: %@
zh_hans: 写入文件：%@
zh_hk: 寫入檔案：%@

# workspace.alert.execution_blocked.message
source: Please wait until the current task finishes before accessing files or settings.
zh_hans: 请等待当前任务完成后再访问文件或设置。
zh_hk: 請等待當前任務完成後再存取檔案或設定。

# workspace.alert.execution_blocked.title
source: Task in Progress
zh_hans: 任务进行中
zh_hk: 任務進行中

# workspace.alert.exit_project.message
source: Exit current project and return to home?
zh_hans: 确认退出当前项目并返回首页吗？
zh_hk: 確認退出當前項目並返回首頁嗎？

# workspace.alert.exit_project.title
source: Exit Project
zh_hans: 退出项目
zh_hk: 退出項目

# workspace.alert.js_error.title
source: Page Script Error
zh_hans: 页面脚本错误
zh_hk: 頁面腳本錯誤

# workspace.alert.load_failed.title
source: Load Failed
zh_hans: 加载失败
zh_hk: 加載失敗

# workspace.js_error.location_format
source: \nLocation: %lld:%lld
zh_hans: \n位置：%lld:%lld
zh_hk: \n位置：%lld:%lld

# workspace.js_error.source_format
source: \nSource: %@
zh_hans: \n来源：%@
zh_hk: \n來源：%@

# workspace.js_error.unknown
source: Unknown JS error
zh_hans: 未知 JS 错误
zh_hk: 未知 JS 錯誤

# workspace.load_error.entry_missing
source: Project entry file index.html does not exist.
zh_hans: 项目入口文件 index.html 不存在。
zh_hk: 項目入口文件 index.html 不存在。

# workspace.panel.chat
source: Chat
zh_hans: 聊天
zh_hk: 聊天

# workspace.panel.exit
source: Exit
zh_hans: 退出
zh_hk: 退出

# workspace.panel.exit_hint
source: 松开退出
zh_hk: 鬆開退出

# workspace.panel.files
source: Files
zh_hans: 文件
zh_hk: 文件

# workspace.panel.refresh
source: Refresh
zh_hans: 刷新
zh_hk: 刷新

# workspace.panel.settings
source: Settings
zh_hans: 设置
zh_hk: 設置
